# Повторение: переменные и типы данных
#-------------------------------------------------------------------------------------------------
name = 'Иван'  # => строка
age = 15  # => целое число
height = 1.75  # => дробное число

new_name = input()  # => ввод строки
new_age = int(input())  # => ввод целого числа
new_height = float(input())  # => ввод дробного числа
numbers = map(int, input().split())  # => ввод целых чисел через пробел

true_cnd = age > 10  # =>  True (верно)
false_cnd = height < 0  # => False (неверно)

#-------------------------------------------------------------------------------------------------
# Тип данных bool
x = 7
print(x > 5)  # =>  True (верно)

x = 3
print(x > 5)  # => False (неверно)

#-------------------------------------------------------------------------------------------------
# Поиск модуля числа: выбор из двух возможных условий
n = int(input())

if n >= 0:  # => проверяем, что число n - неотрицательное
    print(n)
else:  # иначе
    print(-n)

#-------------------------------------------------------------------------------------------------
# Поиск модуля числа: одно небязательное условие
n = int(input())

# проверяем: если число n - отрицательное, то заменяем его на противоположное
if n < 0:
    n = -n
print(n)  # => выводим результат

#-------------------------------------------------------------------------------------------------
# Перевод оценки в пятибалльную шкалу: выбор из трех и более действий
grade = int(input())  # => оценка в баллах

if grade >= 80:
    print('отлично')
elif grade >= 60:
    print('хорошо')
elif grade >= 45:
    print('удовлетворительно')
else:
    print('неудовлетворительно')

# -------------------------------------------------------------------------------------------------
# Сложные условия: является ли число трёхзначным (для положительных)

x = int(input())
if x >= 100 and x <= 999:
    print('Число является трёхзначным')
else:
    print('Число не является трёхзначным')

# без AND
x = int(input())
if 100 <= x <= 999:
    print('Число является трёхзначным')
else:
    print('Число не является трёхзначным')

# -------------------------------------------------------------------------------------------------
# Сложные условия: является ли число трёхзначным (для положительных и отрицательных)
x = int(input())
if 100 <= x <= 999 or -999 <= x <= -100:
    print('Число является трёхзначным')
else:
    print('Число не является трёхзначным')

# -------------------------------------------------------------------------------------------------
# Сложные условия: является ли число отрицательным
x = int(input())
if not x < 0:
    print('Неотрицательное число')
else:
    print('Отрицательное число')

# без NOT
x = int(input())
if x >= 0:
    print('Неотрицательное число')
else:
    print('Отрицательное число')

# -------------------------------------------------------------------------------------------------

