# Повторение: переменные и типы данных
#-------------------------------------------------------------------------------------------------
name = 'Иван'  # => строка
age = 15  # => целое число
height = 1.75  # => дробное число

new_name = input()  # => ввод строки
new_age = int(input())  # => ввод целого числа
new_height = float(input())  # => ввод дробного числа
numbers = map(int, input().split())  # => ввод целых чисел через пробел

true_cnd = age > 10  # =>  True (верно)
false_cnd = height < 0  # => False (неверно)

#-------------------------------------------------------------------------------------------------
# Тип данных bool
x = 7
print(x > 5)  # =>  True (верно)

x = 3
print(x > 5)  # => False (неверно)

#-------------------------------------------------------------------------------------------------
# Поиск модуля числа: выбор из двух возможных условий
n = int(input())

if n >= 0:  # => проверяем, что число n - неотрицательное
    print(n)
else:  # иначе
    print(-n)

#-------------------------------------------------------------------------------------------------
# Поиск модуля числа: одно небязательное условие
n = int(input())

# проверяем: если число n - отрицательное, то заменяем его на противоположное
if n < 0:
    n = -n
print(n)  # => выводим результат

#-------------------------------------------------------------------------------------------------
# Перевод оценки в пятибалльную шкалу: выбор из трех и более действий
grade = int(input())  # => оценка в баллах

if grade >= 80:
    print('отлично')
elif grade >= 60:
    print('хорошо')
elif grade >= 45:
    print('удовлетворительно')
else:
    print('неудовлетворительно')






