# Цикл for. Задачи на последовательность. Операторы break и continue.
#--------------------------------------------------------------------------------------------------
# Шаблон для решения задач на последовательность
n = int(input())  # это количество чисел в последовательности
# значит нам нужно запускать команду ввода n раз => цикл повторится n раз
# одно число в range есть количество повторений цикла
for i in range(n):
    # выполняем ввод числа
    x = int(input())
    # далее можно работать с полученным числом

#--------------------------------------------------------------------------------------------------
# Примеры задач:

# Задача: Дана последовательность из n чисел. Посчитайте, сколько среди них четных чисел.
n = int(input())
count = 0  # переменная для количества
for i in range(n):
    x = int(input())  # получаем введённое число
    if x % 2 == 0:  # проверяем, что число чётное
        count += 1  # увеличиваем количество чётных
print(count)


# Задача на break: Дано целое число n. Выведите YES, если число содержит цифру 3. Иначе выведите NO.
n = int(input())
is_three = 'NO'  # цифра 3 ещё не найдена => ответ NO
# начинаем искать цифры числа, для этого используем цикл while
while n != 0:
    x = n % 10  # получили цифру
    # проверяем, что это цифра 3
    if x == 3:
        # если тройка найдена, заменяем ответ задачи на YES и прерываем цикл
        is_three = 'YES'
        break
    n = n // 10  # удалили цифру
print(is_three)  # выводим полученный ответ


# Задача на continue: Посчитайте количество трёхзначных чисел, которые не делятся ни на 3, ни на 7
count = 0
# формируем последовательность трёхзначных чисел, они находятся в отрезке [100, 999]
for i in range(100, 1000):
    # проверяем, что число i делится или на 3, или на 7
    if i % 3 == 0 or i % 7 == 0:
        continue  # в этом случае сразу переходим к следующему числу
    count += 1  # увеличиваем количество
print(count)

# Решение без continue
count = 0
# формируем последовательность трёхзначных чисел
for i in range(100, 1000):
    # проверяем, что число i не делится ни на 3, ни на 7
    if i % 3 != 0 and i % 7 != 0:
        count += 1  # увеличиваем количество
print(count)

#--------------------------------------------------------------------------------------------------
