# Цикл for. Функция range. Примеры задач.
#--------------------------------------------------------------------------------------------------
# синтаксис цикла: for переменная in последовательность
# действия выполняются для каждого элемента последовательности
# в цикле вместо элементов используется переменная x
for x in 11, 222, 33333, 'abc', 'def':
    print(x)

#--------------------------------------------------------------------------------------------------

# примеры формирования последовательности при помощи range()
# четные числа от 1 до 100
for i in range(2, 101, 2):
    print(i)

# нечетные числа от 100 до 1
for i in range(99, 0, -2):
    print(i)

# числа от 1 до 100, которые делятся на 10
for i in range(10, 101, 10):
    print(i)
#--------------------------------------------------------------------------------------------------
# Примеры задач:

# Задача: вывести целые числа от 1 до n
# считываем целое число с экрана
n = int(input())
# формируем последовательность от 1 до n включительно
for i in range(1, n + 1):
    print(i, end=' ')


# Задача: вывести все числа от A до B, которые делятся на 3
a, b = map(int, input().split())
# формируем последовательность от A до B включительно
for i in range(a, b + 1):
    # проверяем, что число i делится на 3
    if i % 3 == 0:
        print(i, end=' ')


# Задача: вывести сумму всех четных чисел от A до B
a, b = map(int, input().split())
s = 0  # переменная для суммы
# формируем последовательность от A до B включительно
for i in range(a, b + 1):
    # проверяем, что число i четное
    if i % 2 == 0:
        s += i  # прибавляем число к сумме
print(s)

# Решение без условия
a, b = map(int, input().split())
s = 0
a = a + (a % 2)  # делаем число A четным
# перебираем все числа с шагом два (то есть все четные)
for i in range(a, b + 1, 2):
    s += i
print(s)

#--------------------------------------------------------------------------------------------------
# Перебор символов строки в цикле for
# Задача: посчитать, сколько букв а в строке

# считываем строку с экрана
stroka = input()
count = 0  # переменная для количества букв а
# здесь stroka - это последовательность символов
# каждый символ обозначается переменной char
for char in stroka:
    if char == 'а':  # проверяем, что текущий символ - это буква а
        count += 1
print(count)
#--------------------------------------------------------------------------------------------------
