# Разбор частых ошибок, возникающих при решении задач
# Тема 1-2. Команды ввода/вывода, типы данных, f-строки.

#----------------------------------------------------------------------------------------

# Раздел 1.2. Задача "Знакомство"
name = input()  # вводится одна строка - имя человека => используем input()

# Вывести сообщение можно несколькими способами:
print('Привет! Меня зовут ' + name)  # => при помощи оператора +
                                    # (при сложении строки склеиваются)

print('Привет! Меня зовут', name)  # => при помощи свойства команды print
                                # (элементы, указанные в print() через запятую, выводятся через пробел)

print(f'Привет! Меня зовут {name}')  # => при помощи f-строки
                                # (переменную можно указывать прямо внутри текста)

# Примеры неверных решений:
print('Привет! Меня зовут' + name)  # => не хватает пробела - имя приклеится к слову "зовут"
print('Привет! Меня зовут ', name)  # => пробел лишний - запятая в print() уже означает пробел между значениями
print(f'Привет! Меня зовут name')  # => переменные долны указываться в фигурных скобках, чтобы выводилось их значение

#----------------------------------------------------------------------------------------

# Раздел 1.2. Задача "Который час?"
# Дано два значения - часы и минуты => используем input() дважды для каждой строки со значением:
h = input()  # => создали переменную для часов и сохранили туда первое значение
m = input()  # => создали переменную для минут и сохранили туда следующее значение

# Вывести время в нужном формате можно несколькими способами:
print(h + ':' + m)  # склеиваем строки при помощи оператора +
print(h, m, sep=':')  # => используем разделитель sep - он заменит пробел между значениями на двоеточие
print(f'{h}:{m}')  # => используем f-строку - здесь двоеточие это часть текста (без фигурных скобок)
                    # а переменные h и m по правилам f-строк указываются внутри фигурных скобок

# Примеры неверных решений:
print(h + m, sep=':')  # => часы и минуты просто склеиваются знаком +, sep не работает для одного элемента
print(f'h:m')  # => h и m без фигурных скобок считаются обычными символами,
                # поэтому вместо их значений получим "h:m"
print(10, 15, sep=':')  # программа для любых введённых значений будет выводить 10:15

#----------------------------------------------------------------------------------------

# Раздел 1.3. Задача "Строка vs Число
# Нам дано два значения => две команды input()
a = input()  # получили строку - набор символов
b = input()  # получили строку - набор символов

scl = a + b  # => результат склейки двух строк

# Чтобы сделать строку числом, можно применить функцию int()
sm = int(a) + int(b)  # => результат сложения двух целых чисел

# выводим результаты через пробел => в одной команде print() через запятую
print(sm, scl)

# Примеры неверных решений:
#1
a = 5
b = 7
print(a + b, '57')  # => программа работает только для чисел 5 и 7!

#2
a = int(input())
b = int(input())
print(a + b)
c = input()
d = input()
print(c + d)  # по задаче дано только два значения, здесь же input() используется 4 раза!

#----------------------------------------------------------------------------------------

# Раздел 1.3. Задача "Туристическое агентство"
#1. Правильное решение
NAME = input()
D = int(input())
S = float(input())
print(f"Здравствуйте, {NAME}! Ваша поездка продлится {D} дней. К оплате: {S} рублей.")

#2. Не совсем правильное решение
NAME = input()
D = input()
S = input()
print(f"Здравствуйте, {NAME}! Ваша поездка продлится {D} дней. К оплате: {S} рублей.")

# Во втором решении и имя, и возраст, и стоимость вводятся как строки,
# то есть если мы, например, в качестве возраста введём не целое число, а набор букв,
# то программа не выведет ошибку, хотя должна, ведь возраст может быть только числом, как и стоимость.
# Поэтому более точным будет первое решение.

#----------------------------------------------------------------------------------------
