# Цикл while. Введение.

#-----------------------------------------------------------------------------------------------------
# Рассмотрим задачу. Дано число n, требуется вывести все числа от 1 до n на экран
n = int(input())
# будем последовательно выводить n на экран, а после переходить к предыдущему числу, уменьшая n на 1
print(n)
n = n - 1
print(n)
n = n - 1
print(n)
n = n - 1
# Когда же стоит остановиться? => Нужна проверка (условие) - когда дойдём до нуля, нужно остановить программу
# Исправленное решение:
print(n)
n = n - 1
if n == 0:
    exit()

print(n)
n = n - 1
if n == 0:
    exit()

print(n)
n = n - 1
if n == 0:
    exit()
# И так нужно повторить эти действия много раз, чобы учесть множество значений n - это неэффективно
# В Python есть конструкция, которая позволяет повторять действия,
# пока условие остаётся верным (в нашем случае пока n > 0) - цикл while (пока)

# Решение через цикл:
n = int(input())
while n > 0:  # пока n > 0 повторяем действия, записанные с отступом; если условие стало неверным, прекращаем повторение
    print(n)
    n = n - 1
print('Конец цикла')

#-----------------------------------------------------------------------------------------------------
# Задача. Дано число N. Требуется вывести все числа от 1 до N (не включительно), кратные 5.
n = int(input())
k = 1  # начинаем проверять числа с единицы
# повторяем действия, пока не дойдём до n => пока k <= n
while k <= n:
    # выводим число, если оно делится на 5
    if k % 5 == 0:
        print(k)
    k = k + 1  # переходим к проверке следующего числа

# Все числа, кратные 5, отличаются друг от друга ровно на 5 => решение можно записать и без условия:
n = int(input())
k = 5  # начинаем проверять с первого числа, которое делится на 5
# повторяем действия, пока не дойдём до n => пока k <= n
while k <= n:
    # выводим число и увеличиваем его ровно на 5 (переходим к следующему, кратному 5)
    print(k)
    k = k + 5

#-----------------------------------------------------------------------------------------------------
# Составной оператор присваивания
# Задача. Дано число n. Требуется вывести следующее за ним число (на единицу больше)
n = int(input())
n = n + 1  # увеличиваем n на 1 => переходим к следующему
print(n)

# Или сокращенная запись:
n = int(input())
n += 1
print(n)

#-----------------------------------------------------------------------------------------------------
# Задача. Даны числа A и B. Необходимо вывести все числа от A до B, которые не делятся на 3.
a, b = map(int, input().split())
# создаём переменную, в которой будем считать количество
count = 0  # ещё не нашли ни одного числа => ноль
k = a  # начинаем проверку с первого числа A
while k <= b:  # идём до B
    # если находим число, не кратное 3, то количество становится больше на 1
    if k % 3 != 0:
        count = count + 1
    k = k + 1  # переходим к следующему числу

#-----------------------------------------------------------------------------------------------------
# Задача. Даны числа A и B. Необходимо вывести все числа от A до B через пробел.
a, b = map(int, input().split())
k = a  # начинаем с первого числа A
while k <= b:  # идём до B
    print(k, end=' ')  # выводим текущее число и вместо перехода на новую строку ставим пробел
    k = k + 1  # переходим к следующему числу


