# Цикл while: задачи на ввод значений, задачи на цифры числа, бесконечный цикл
#---------------------------------------------------------------------------------------------------------------------------

# Дана последовательность целых чисел, оканчивающаяся нулём. Посчитайте количество введеных чисел.
count = 0  # переменная для количества чисел

x = int(input()) # запрашиваем первое число с экрана
# пока не получим 0, продолжаем запрашивать числа
while x != 0:
    # после получения каждого числа увеличиваем количество
    count = count + 1
    x = int(input())  # запрашиваем новое число
print(count)

#---------------------------------------------------------------------------------------------------------------------------

# Поиск суммы цифр числа
n = int(input())  # запрашиваем исходное число
summa = 0  # создаём переменную для суммы

# выполняем цикл, пока не удалим все цифры из числа
while n != 0:
    x = n % 10  # получаем последнюю цифру
    summa = summa + x  # прибавляем к общей сумме
    n = n // 10  # удаляем её из числа
print(summa)

#---------------------------------------------------------------------------------------------------------------------------

# Поиск максимума
mx = -100  # создаём переменную для максимума (изначально маленькое число)
x = int(input())  # запрашиваем первое число от пользователя

# пока не получим 0, продолжаем запрашивать числа
while x != 0:
    # если введённое число больше текущего максимального,
    # то заменяем максимум на это число
    if x > mx:
       mx = x
    x = int(input())  # запрашиваем следующее число от пользователя
print(mx)

#---------------------------------------------------------------------------------------------------------------------------

# Пример бесконечного цикла
while True:
    print("Это будет печататься вечно")
    break


#---------------------------------------------------------------------------------------------------------------------------

# Поиск делителей числа
n = int(input())
d = 1  # первый наименьший делитель числа
# перебираем числа от 1 до n, так как делитель не может быть больше делимого
while d <= n:
    # проверяем, что наше число n делится на заданное d
    if n % d == 0:
        print(d)
    d += 1  # переходим к следующему возможному делителю

# решение 2: перебор до половины числа
n = int(input())
d = 1  # первый наименьший делитель числа
# перебираем числа от 1 до n/2
while d <= n // 2:
    if n % d == 0:
        print(d)
    d += 1  # переходим к следующему возможному делителю

# решение 3: перебор до корня из числа
n = int(input())
d = 1  # первый наименьший делитель числа
# перебираем все делители d, такие, что d * d <= n
while d * d <= n:  # или while d <= N**0.5
    if n % d == 0:
        print(d)
    d += 1  # переходим к следующему возможному делителю
#---------------------------------------------------------------------------------------------------------------------------
