# Цикл while: задачи на ввод значений, задачи на цифры числа, бесконечный цикл
#---------------------------------------------------------------------------------------------------------------------------

# Дана последовательность целых чисел, оканчивающаяся нулём. Посчитайте количество введеных чисел.
count = 0  # переменная для количества чисел

x = int(input()) # запрашиваем первое число с экрана
# пока не получим 0, продолжаем запрашивать числа
while x != 0:
    # после получения каждого числа увеличиваем количество
    count = count + 1
    x = int(input())  # запрашиваем новое число
print(count)

#---------------------------------------------------------------------------------------------------------------------------

# Поиск суммы цифр числа
n = int(input())  # запрашиваем исходное число
summa = 0  # создаём переменную для суммы

# выполняем цикл, пока не удалим все цифры из числа
while n != 0:
    x = n % 10  # получаем последнюю цифру
    summa = summa + x  # прибавляем к общей сумме
    n = n // 10  # удаляем её из числа
print(summa)

#---------------------------------------------------------------------------------------------------------------------------

# Поиск максимума
mx = -100  # создаём переменную для максимума (изначально маленькое число)
x = int(input())  # запрашиваем первое число от пользователя

# пока не получим 0, продолжаем запрашивать числа
while x != 0:
    # если введённое число больше текущего максимального,
    # то заменяем максимум на это число
    if x > mx:
       mx = x
    x = int(input())  # запрашиваем следующее число от пользователя
print(mx)

#---------------------------------------------------------------------------------------------------------------------------

# Пример бесконечного цикла
while True:
    print("Это будет печататься вечно")


#---------------------------------------------------------------------------------------------------------------------------
