# Цикл while. Аналогии. Отличие от условия if.
#-----------------------------------------------------------------------------------------------------
# Рассмотрим задачу. На столе лежат три кубика. Робот перекладывает их в коробку по одному.

# 1) Пока на столе есть кубики, нужно перекладывать по одному.
cubes = 3

while cubes > 0:
    print("Переложили один кубик")
    cubes = cubes - 1

print("На столе больше нет кубиков")

# 2) Если на столе есть кубики, нужно переложить один.
cubes = 3

if cubes > 0:
    print("Переложили один кубик")
    cubes = cubes - 1

print("Осталось кубиков:", cubes)

#-----------------------------------------------------------------------------------------------------
# Аналогия с подъёмом по леснице и переходом на следующий этаж:

final_etazh = int(input())  # => количество этажей в доме (целое)
now_etazh = 1  # => первый этаж, с него начинаем идти

print('Начинаем подъём')
# пока не дойдём до последнего этажа, поднимаемся
while now_etazh <= final_etazh:
    print(f'Я сейчас на {now_etazh} этаже')
    now_etazh += 1  # => переходим на следующий этаж

print('Подъём окончен')

#-----------------------------------------------------------------------------------------------------
